{"isbn":null,"title":"Kafka on the Shore by Haruki Murakami","authors":["Haruki Murakami"],"summary":"Paperback","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1696957225i/129446867.jpg","genres":["Literary Fiction","Fiction","Literature","Classics","Magical Realism","Japanese Literature","Book Club","Fantasy","Audiobook","Novels"],"year":1104566400000,"rating":[8040,21210,80075,197194,210380]}
{"isbn":"0440236924","title":"Kaleidoscope","authors":["Danielle Steel"],"summary":"When a beautiful young Frenchwoman and a brilliant American actor meet in wartime Paris, their love begins like a fairy tale but ends in tragedy. Suddenly orphaned, their three children are cruelly separated. Megan, the baby, adopted by a family of comfortable means, becomes doctor in the rural Appalachia. Alexandra, raised in lavish wealth, marries a powerful man whose pride is his pedigree and who assumes that Alexandra is her parents' natural offspring. Neither of them has the remotest suspicion that she is adopted, or what turbulent tragedy lurks in her past. And Hilary, oldest of the Walker children, remembers them all, and the grief that tore them apart and cast them into separate lives. Feeling the loss throughout her life, and unable to find her sisters, she builds an extraordinary career and has no personal life. When John Chapman, lawyer and prestigious private investigator, is asked to find these three women, he wonders why. Their parents' only friend, he did nothing to keep them together  as children and has been haunted by remorse all his life. The investigator follows a trail that leads from chic New York to Boston slums, from elegant Parisian salons to the Appalachian hills, to the place where the three sisters face each other and one more final, devastating truth before they can move on.","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1173371736i/278102.jpg","genres":["Adult Fiction","Contemporary Romance","Romance","Novels","Contemporary","Drama","Adult","Chick Lit","Historical Fiction","Fiction"],"year":972716400000,"rating":[200,835,4169,5248,6116]}
{"isbn":"0316428469","title":"Kingdom of the Wicked","authors":["Kerri Maniscalco"],"summary":"Two sisters.One brutal murder.A quest for vengeance that will unleash Hell itself...And an intoxicating romance.Emilia and her twin sister Vittoria are streghe - witches who live secretly among humans, avoiding notice and persecution. One night, Vittoria misses dinner service at the family's renowned Sicilian restaurant. Emilia soon finds the body of her beloved twin...desecrated beyond belief. Devastated, Emilia sets out to find her sister's killer and to seek vengeance at any cost—even if it means using dark magic that's been long forbidden.Then Emilia meets Wrath, one of the Wicked—princes of Hell she has been warned against in tales since she was a child. Wrath claims to be on Emilia's side, tasked by his master with solving the series of women's murders on the island. But when it comes to the Wicked, nothing is as it seems...","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1578938260l/52735921.jpg","genres":["Paranormal","Romantasy","Enemies To Lovers","Mystery","Fantasy Romance","Young Adult Fantasy","Magic","Young Adult","Fiction","Witches"],"year":1603782000000,"rating":[6573,20405,78916,132160,95656]}
{"isbn":null,"title":"Kalona's Fall","authors":["Kristin Cast","P.C. Cast"],"summary":"In KALONA'S FALL, the shadows in Kalonas past will finally come to light We will learn about the winged immortal's secret history and discover how he went from being the Goddess's Warrior and Guardian to her enemy and betrayer. Did Darkness taint Kalona as it did Neferet, or has the powerful immortal always preferred power over honor, and control over faith? This novella will be crucial to fans' understanding of Kalona, before his role in the explosive final installment of the House of Night, REDEEMED.","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1384283250i/16136628.jpg","genres":["Paranormal","Supernatural","Romance","Fantasy","Novella","Vampires","Magic","Young Adult","Fiction","Paranormal Romance"],"year":1406617200000,"rating":[142,457,1492,2037,3220]}
{"isbn":"0593530063","title":"Kapaemahu","authors":["Joe Wilson","Daniel Sousa","Hinaleimoana Wong-Kalu","Dean Hamer"],"summary":"An Indigenous legend about how four extraordinary individuals of dual male and female spirit, or Mahu, brought healing arts from Tahiti to Hawaii, based on the Oscar Award-contending short film.   In the 15th Century, four Mahu sail from Tahiti to Hawaii and share their gifts of science and healing with the people of Waikiki. The islanders return this gift with a monument of four boulders in their honor, which the Mahu imbue with healing powers before disappearing.As time passes, foreigners inhabit the island and the once sacred stones are forgotten until the 1960s. Though the true story of these stones was not fully recovered, the power of the Mahu still calls out to those who pass by them at Waikiki Beach today. With illuminating words and stunning illustrations by Hinaleimoana Wong-Kalu, Dean Hamer, Joe Wilson, and Daniel Sousa, KAPAEMAHU is a monument to an Indigenous Hawaiian legend and a classic in the making.","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1632076541i/58988439.jpg","genres":["Picture Books","Folklore","Mythology","Queer","Nonfiction","Indigenous","History","LGBT","Gender","Childrens"],"year":1654585200000,"rating":[1,17,86,297,504]}
{"isbn":null,"title":"Kandinsky: The First Abstract Watercolour Painting (One Hundred Paintings) by Federico Zeri","authors":["Federico Zeri"],"summary":"Focusing on his \"First Abstract Watercolour,\" chronicles the artist's experimentations with form, color and technique, and examines his educational background and influences as he traveled between Russia, Germany and France.","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1694926620i/171209225.jpg","genres":null,"year":null,"rating":[0,0,0,1,0]}
{"isbn":"1481477676","title":"Kaleidoscope Song","authors":["Fox Benwell"],"summary":"South Africa is loud. Listen. Do you hear the song and dance of it? The chorus of Khayelitsha life? Every voice is different, its pitch and tone and intonation as distinct as the words we choose and how we wrap our mouths around them. But everybody has a voice, and everybody sings…Fifteen year old Neo loves music, it punctuates her life and shapes the way she views the world. A life in radio is all she’s ever wanted.When Umzi Radio broadcasts live in a nearby bar Neo can’t resist. She sneaks out to see them, and she falls in love, with music, and the night, but also with a girl: Tale has a voice like coffee poured into a bright steel mug, and she commands the stage.It isn’t normal. Isn’t right. Neo knows that she’s supposed to go to school and get a real job and find a nice young boy to settle down with. It’s written everywhere – in childhood games, and playground questions, in the textbooks, in her parents’ faces. But Tale and music are underneath her skin, and try as she might, she can’t stop thinking about them.","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1486396504i/29620980.jpg","genres":["Africa","Romance","Contemporary","Queer","Unfinished","LGBT","Music","Gay","Young Adult","Fiction"],"year":1505804400000,"rating":[10,18,74,113,83]}
{"isbn":"0062643835","title":"Kate in Waiting","authors":["Becky Albertalli"],"summary":"From bestselling YA rom-com queen Becky Albertalli, author of Simon vs the Homo Sapiens Agenda (Love, Simon), comes a new novel about daring to step out of the shadows and into the spotlight in love, life and, yes, theatre.Contrary to popular belief, best friends Kate Garfield and Anderson Walker are not codependent. Carpooling to and from theatre rehearsals? Environmentally sound and efficient. Consulting each other on every single life decision? Basic good judgment. Pining for the same guys from afar? Shared crushes are more fun anyway.But when Kate and Andy's latest long-distance crush shows up at their school, everything goes off-script. Matt Olsson is talented and sweet, and Kate likes him. She really likes him. The only problem? So does Anderson. Turns out, communal crushes aren't so fun when real feelings are involved. This one might even bring the curtains down on Kate and Anderson's friendship.","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1599810921i/48579405.jpg","genres":["Realistic Fiction","Romance","Contemporary","Friendship","Queer","Young Adult Contemporary","LGBT","Audiobook","Young Adult","Fiction"],"year":1618902000000,"rating":[180,692,3204,4743,2826]}
{"isbn":"1984895672","title":"Best Friends for Never","authors":["Stephanie Yue","Colleen A.F. Venable"],"summary":"Katie loves skating with the Wheelas and the fact that she’s officially a superhero sidekick. But now that school’s starting, everything’s changing. The Mousetress is getting blamed for things Katie knows she didn’t do. Sidekick training is NOT as exciting as she’d hoped. Katie’s best friend Beth is back in town and Beth’s new boyfriend is always hanging around (ugh!). Not to mention that all of Katie’s friends are mad at her. Fixing this will be harder than any skateboarding trick. But with the help of 217 slightly out of the ordinary cats, Katie’s going to try! Can she clear the Mousestress’s name, uncover the real supervillain, and become the sidekick (and the friend) she’s always dreamed of being?","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1630603615i/57361840.jpg","genres":["Comics","Childrens","Superheroes","Friendship","Graphic Novels","Fantasy","Middle Grade","Cats","Animals","Fiction"],"year":1644912000000,"rating":[20,45,233,607,796]}
{"isbn":"0803732635","title":"Keena Ford and the Second Grade Mix Up","authors":["Melissa Thomson"],"summary":"Meet an irrepressible young lady with a flair for getting into trouble! Sassy, fun-loving Keena Ford always tries to do the right thing, but somehow, she just keeps making things worse. Keena is super excited about starting second grade and she?s eager to impress her new teacher?but why does Ms. Hanson think Keena?s birthday is tomorrow? It was a small mistake, but now Keena can?t turn down her very own chocolate cake and sparkly crown, can she? No more than she can help sneaking into her best friend Eric?s classroom to see if it?s really as much fun as he claims. Too bad nothing turns out quite the way she plans . . . This laugh-out-loud book by first-time author Melissa Thomson has short chapters and lively illustrations, making it perfect for beginning readers.","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1347761769i/2356343.jpg","genres":["Chapter Books","Realistic Fiction","Fiction","Childrens","Cultural","Juvenile","School","Teen","Middle Grade","2nd Grade"],"year":1215068400000,"rating":[5,10,94,217,303]}
{"isbn":"1416950605","title":"Keeper","authors":["August Hall","Kathi Appelt"],"summary":"Keeper is a breathtaking, magical novel from National Book Award finalist and Newbery Honoree Kathi Appelt.To ten-year-old Keeper the moon is her chance to fix all that has gone wrong ... and so much has gone wrong.But she knows who can make things right again: Maggie Marie, her mermaid mother, who swam away when Keeper was just three. A blue moon calls the mermaids to gather at the sandbar, and that's exactly where Keeper is headed - in a small boat. In the middle of the night, with only her dog, BD (Best Dog), and seagull named Captain. When the riptide pulls at the boat, tugging her away from the shore and deep into the rough waters of the Gulf of mexico, panic sets in and the fairy tales that lured her out there go tumbling into the waves. Maybe the blue moon won't sparkle with mermaids and maybe - Oh, no ... \"Maybe\" is just too difficult to bear.","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1630482565i/6609700.jpg","genres":["Realistic Fiction","Adventure","Childrens","Magical Realism","Juvenile","Fantasy","Middle Grade","Mermaids","Young Adult","Fiction"],"year":1274166000000,"rating":[126,310,776,1031,954]}
{"isbn":"0060878061","title":"Keeping Faith","authors":["Jodi Picoult"],"summary":"“A triumph. This novel’s haunting strength will hold the reader until the very end and make Faith and her story impossible to forget.”— Richmond Times Dispatch “Extraordinary.”— Orlando Sentinel From the #1 New York Times bestselling author Jodi Picoult ( Nineteen Minutes, Change of Heart, Handle with Care ) comes Keeping Faith : an “addictively readable” ( Entertainment Weekly ) novel that “makes you wonder about God. And that is a rare moment, indeed, in modern fiction” ( USA Today ).","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1407111555i/10913.jpg","genres":["Adult Fiction","Romance","Novels","Contemporary","Drama","Adult","Chick Lit","Book Club","Religion","Fiction"],"year":1140508800000,"rating":[1272,5541,24573,33558,23074]}
{"isbn":"0316009857","title":"Keeping You a Secret","authors":["Julie Anne Peters"],"summary":"With a steady boyfriend, the position of Student Council President, and a chance to go to an Ivy League college, high school life is just fine for Holland Jaeger.At least, it seems to be. But when Cece Goddard comes to school, everything changes. Cece and Holland have undeniable feelings for each other, but how will others react to their developing relationship?","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1358442201i/272315.jpg","genres":["Realistic Fiction","Romance","Contemporary","Queer","Teen","LGBT","Gay","Lesbian","Young Adult","Fiction"],"year":1115190000000,"rating":[1240,2646,7889,10301,14426]}
{"isbn":"1338607529","title":"Keep It Together, Keiko Carter","authors":["Debbi Michiko Florence"],"summary":"Seventh grade is supposed to be a game changer. And Keiko thinks she's got it covered, especially with Audrey and Jenna by her side to shop for a new look, pick out a prime lunch spot, and even hit up that cute new bubble tea place after school. Her trio is ready to tackle life as they always have...together.But when Audrey decides they need boyfriends before Fall Ball, it looks like things may be changing in all the wrong ways. Jenna is sick of caving in to Audrey's demands, and soon Keiko's besties are barely talking, leaving her caught in the middle. While she's been dreaming about triple-dates, first kisses, and a boy she really shouldn't have a crush on, the friendship she's always thought was rock-solid is beginning to crumble.Keiko feels pulled in two directions. Should she try to help her friends-even if it means losing one of them-or follow her heart? When it comes to flirting, friendships, and fallouts, how is Keiko supposed to keep it all together?","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1566279666l/49822929.jpg","genres":["Realistic Fiction","Romance","Contemporary","Friendship","School","Asian Literature","Middle Grade","Audiobook","Young Adult","Fiction"],"year":1588662000000,"rating":[18,74,273,537,730]}
{"isbn":"0439925363","title":"Kendra","authors":["Coe Booth"],"summary":"The acclaimed author of TYRELL returns to PUSH with a striking novel about a mother and daughter who are only fourteen years apart, but need to learn to understand each other before it's too late.Kendra's mom, Renee, had her when she was only 14 years old. Renee and her mom made a deal -- Renee could get an education, and Kendra would live with her grandmother. But now Renee's out of grad school and Kendra's in high school ... and getting into some trouble herself. Kendra's grandmother lays down the It's time for Renee to take care of her daughter. Kendra wants this badly -- even though Renee keeps disappointing her. Being a mother isn't easy, but being a daughter can be just as hard. Now it's up to Kendra and Renee to make it work.","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1328843403i/3112839.jpg","genres":["Realistic Fiction","Coming Of Age","Romance","Contemporary","Cultural","Urban","Teen","African American","Young Adult","Fiction"],"year":1222844400000,"rating":[50,79,315,433,860]}
{"isbn":"1423134540","title":"Keys to the Repository","authors":["Melissa de la Cruz"],"summary":"Lavish parties.Passionate meetings in the night. Bone-chilling murders. Midterms. The day-to-day life of Schuyler Van Alen and her Blue Bloods friends (and enemies) is never boring. But there's oh-so-much more to know about these beautiful and powerful teens.Below the streets of Manhattan, within the walls of the Repository, exists a wealth of revealing information about the vampire elite that dates back before the Mayflower. Ina series of short stories, journal entries, and never-before-seen letters, New York Times bestselling author Melissa de la Cruz gives her hungry fansthe keys to the Repository and aneven more in-depth look into the secret world of the Blue Bloods.Won't you come inside?Book Details:  Format: Hardcover  Publication Date: 6/29/2010  Pages: 240  Reading Level: Age 18 and Up  ","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1422103000i/7031834.jpg","genres":["Paranormal","Supernatural","Romance","Fiction","Urban Fantasy","Angels","Fantasy","Paranormal Romance","Young Adult","Vampires"],"year":1277794800000,"rating":[362,1484,4114,3466,4127]}
{"isbn":"9833346685","title":"Kenang-Kenangan Seorang Geisha","authors":["Arthur Golden"],"summary":"The long-anticipated Malay edition of Memoirs of a Geisha ¡V the runaway bestseller that has captivated audiences worldwide ¡V is finally out! Geisha is probably one aspect founded in the rituals of Japanese culture that is very popular among non-Japanese society, depicting it as a foreign culture, which is surrounded with mystery. In this novel, we will enter a realm where aesthetic beauty is very crucial; the virginity of a lass is auctioned and sold to the highest bidder; a world that trains a young girl to entice men of great social standing; a place where love is considered as an illusion.This highly captivating novel depicts the beauty in the form of Sayuri and as she develops the grace of a geisha, power comes with it. Through her eyes, we see the decadent heart of Gion ¡V the geisha district of Kyoto ¡V with its marvellous teahouses and theatres, narrow back alleys, ornate temples and artists¡¦ streets. Sayuri eventually transforms into a desirable woman as she takes on the laborious tasks of serving and pouring tea, traditional makeup and hair. The challenge begins and the money that goes with it as she competes against her closest rival and how cleverly her mentor, Mameha plans for her manoeuvres to captivate powerful men. When World War II erupts and the geisha houses are forced to close, Sayuri suffers during this phase of her life but she gains her freedom nevertheless, being released and unbounded by any geisha house. Memoirs of a Geisha is convincingly told with nuances and metaphors, rich in Japanese culture, of memorable characters rendered with humour and pathos. A remarkable work of fiction that is unique ¡K romantic, erotic, thrilling ¡K undoubtedly memorable.The content of the novel is based on an interview conducted by Arthur with a former geisha and this special research undertook by him required a period of ten years. The interesting narration of the novel is a leading factor that makes it into an adaptation of a film, also entitled Memoirs of a Geisha . This book has been translated into 35 languages.","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1167348140i/22277.jpg","genres":["Asia","Historical","Romance","Novels","Contemporary","Adult Fiction","Adult","Book Club","Historical Fiction","Fiction"],"year":1151737200000,"rating":[30345,74273,335241,727540,899498]}
{"isbn":"1282043803","title":"Khaled Hosseini's The Kite Runner","authors":["Harold Bloom"],"summary":"In \"The Kite Runner,\" history and personal responsibility come together in the story of Amir, an Afghan boy who is haunted by the guilt of betraying his childhood friend Hassan, the son of his father's servant. In the background loom the many tumultuous changes that have gripped Afghanistan in the years since Amir's carefree kite-flying childhood. From the fall of the monarchy through the Soviet invasion to the mass exodus of refugees to Pakistan and the United States to the rise of the Taliban regime, the story of Amir and Hassan emerges as the story of Afghanistan itself. The engaging new guide to this modern-day classic features an annotated bibliography, a listing of other works by the author, and an introduction by noted literary scholar Harold Bloom.","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1729714970i/16902736.jpg","genres":["Novels","Historical Fiction","Fiction"],"year":1230796800000,"rating":[22,32,156,726,2775]}
{"isbn":"0786838590","title":"Keeping Corner","authors":["Kashmira Sheth"],"summary":"Pretty as a peacock, twelve-year-old Leela has been spoiled all her life. She doesn't care for school and barely marks the growing unrest between the British colonists and her own countrymen. Why should she? Her future has been planned since her engagement at two and marriage at nine.Leela's whole life changes, though, when her husband dies. She's now expected to behave like a proper widow: shaving her head and trading her jewel-toned saris for rough, earth-colored ones. Leela is considered unlucky now, and will have to stay confined to her house for a year—keep corner—in preparation for a life of mourning a boy she barely knew. When her schoolteacher hears of her fate, she offers Leela lessons at home. For the first time, despite her confinement, Leela opens her eyes to the changing world around her. India is suffering from a severe drought, and farmers are unable to pay taxes to the British. She learns about a new leader of the people, a man named Gandhi, who starts a political movement and practices satyagraha—non-violent protest against the colonists as well as the caste system. The quiet strength of satyagraha may liberate her country. Could she use the same path to liberate herself?","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1438189686i/1037637.jpg","genres":["Historical","Coming Of Age","Cultural","India","Teen","Middle Grade","Historical Fiction","Family","Young Adult","Fiction"],"year":1193727600000,"rating":[40,110,475,729,474]}
{"isbn":"1683691415","title":"Kid Activists: True Tales of Childhood from Champions of Change","authors":["Robin Stevenson","Allison Steinfeld"],"summary":"Moving, relatable, and totally true childhood biographies of Martin Luther King Jr., Susan B. Anthony, Helen Keller, Malala Yousafzai, and 12 other inspiring activists. Every activist started out as a kid—and in some cases they were kids when their activism began! But even the world’s greatest champions of civil liberties had relatable interests and problems--often in the middle of extraordinary circumstances. Martin Luther King, Jr. loved fashion, and argued with his dad about whether or not dancing was a sin. Harvey Milk had a passion for listening to opera music in different languages. Dolores Huerta was once wrongly accused of plagiarizing in school.  Kid Activists  tells these childhood stories and more through kid-friendly texts and full-color cartoon illustrations on nearly every page. The diverse and inclusive group encompasses  Susan B. Anthony ,  James Baldwin ,  Ruby Bridges ,  Frederick Douglass ,  Alexander Hamilton ,  Dolores Huerta ,  Helen Keller ,  Martin Luther King Jr. ,  Nelson Mandela ,  Iqbal Masih ,  Harvey Milk ,  Janet Mock ,  Rosa Parks ,  Autumn Peltier ,  Emma Watson , and  Malala Yousafzai .","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1555085929i/45028256.jpg","genres":["Picture Books","Biography Memoir","Juvenile","Biography","Teaching","Nonfiction","History","Social Justice","Middle Grade","Childrens"],"year":1569308400000,"rating":[0,5,23,91,120]}
{"isbn":"0963796690","title":"Kids Helping Kids Break the Silence of Sexual Abuse","authors":["Linda Lee Blakemore","Linda Lee Foltz"],"summary":"Every day, millions of American children are in danger of sexual abuse. Author Linda Lee Foltz wrote Kids Helping Kids Break the Silence of Sexual Abuse to help stop the cycle and protect children everywhere. After healing from her own childhood sexual abuse, she wanted to \"make a difference\" and began volunteering at a child advocacy program. There she met hundreds of kids whose lives, like hers, were forever altered. She soon learned that children are more likely to listen to and learn from each other, which became the basis for her book. In their own words, victimized kids reveal valuable life lessons about living, loving and healing, and how to get safe and stay away from sexual abuse.","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1385211470i/2476502.jpg","genres":null,"year":1046505600000,"rating":[0,0,2,1,7]}
{"isbn":"0061566128","title":"Killer","authors":["Sara Shepard"],"summary":"In picture-perfect Rosewood, Pennsylvania, pictures often lie-and so do Rosewood's four prettiest girls. Hanna's on a mission to corrupt Rosewood's youth, starting with a very attractive sophomore. Aria's snooping into her boyfriend's past. Spencer's stealing-from her family. And pure little Emily's abstaining from abstinence. The girls should be careful, though. They thought they were safe when Ali's killer was arrested and A's true identity was finally revealed. But now there's a new A in town turning up the heat. And this time Rosewood is going to burn.","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1246065139i/3047849.jpg","genres":["Realistic Fiction","Romance","Contemporary","Mystery Thriller","Chick Lit","Teen","Mystery","Thriller","Young Adult","Fiction"],"year":1246345200000,"rating":[733,2776,12238,17047,20194]}
{"isbn":null,"title":"[( Theodore Boone: Kid Lawyer )] [by: John Grisham] [May-2010]","authors":["John Grisham"],"summary":"A perfect murderA faceless witnessA lone courtroom champion knows the whole truth . . . and he’s only thirteen years oldMeet Theodore BooneIn the small city of Strattenburg, there are many lawyers, and though he’s only thirteen years old, Theo Boone thinks he’s one of them. Theo knows every judge, policeman, court clerk—and a lot about the law. He dreams of being a great trial lawyer, of a life in the courtroom.But Theo finds himself in court much sooner than expected. Because he knows so much—maybe too much—he is suddenly dragged into the middle of a sensational murder trial. A cold-blooded killer is about to go free, and only Theo knows the truth.The stakes are high, but Theo won’t stop until justice is served.Brimming with the intrigue and suspense that made John Grisham a #1 international bestseller and the undisputed master of the legal thriller, Theodore Kid Lawyer will keep readers guessing and pages turning.","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1694855102i/162593651.jpg","genres":["Realistic Fiction","Childrens","Crime","Legal Thriller","Mystery","Middle Grade","Thriller","Audiobook","Young Adult","Fiction"],"year":null,"rating":[928,2946,11158,14242,11472]}
{"isbn":"1620141434","title":"Killer of Enemies","authors":["Joseph Bruchac"],"summary":"A post-Apocalyptic YA novel with a steampunk twist, based on an Apache legend. Years ago, seventeen-year-old Apache hunter Lozen and her family lived in a world of haves and have-nots. There were the Ones -- people so augmented with technology and genetic enhancements that they were barely human -- and there was everyone else who served them. Then the Cloud came, and everything changed. Tech stopped working. The world plunged back into a new steam age. The Ones' pets -- genetically engineered monsters -- turned on them and are now loose on the world.Lozen was not one of the lucky ones pre-C, but fate has given her a unique set of survival skills and magical abilities. She hunts monsters for the Ones who survived the apocalyptic events of the Cloud, which ensures the safety of her kidnapped family. But with every monster she takes down, Lozen's powers grow, and she connects those powers to an ancient legend of her people. It soon becomes clear to Lozen that she is not just a hired gun. As the legendary Killer of Enemies was in the ancient days of the Apache people, Lozen is meant to be a more than a hunter. Lozen is meant to be a hero.","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1379444491i/17946249.jpg","genres":["Dystopia","Steampunk","Native American","Post Apocalyptic","Teen","Survival","Fantasy","Science Fiction","Young Adult","Fiction"],"year":1379401200000,"rating":[67,93,189,296,209]}
{"isbn":"0385734557","title":"Killer Spirit","authors":["Jennifer Lynn Barnes"],"summary":"Saying Toby Klein is an unlikely cheerleader is like saying Paris Hilton might be into guys--understatement of the year. But the varsity squad at Bayport High gives new meaning to the phrase All-American, and Toby's double life as a varsity cheerleader and a government operative means balancing protocol, pep rallies, computer hacking, and handsprings.Now something's about to go down in Bayport, and the Big Guys Upstairs need to know what. The Squad is on the case, but it looks like this mission could put the \"l\" in lethal. And if the spy business doesn't kill Toby, it's starting to look like Brooke, the team's captain, might. The nominations are in for homecoming court, and rumor has it that Toby is the unlikely front-runner for queen.Terrorist threat? Bloody mission gone wrong? Demented squad captain?Bring it on.","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1320457237i/1188295.jpg","genres":["Action","Romance","Adventure","Contemporary","Fiction","Teen","Mystery","Young Adult","Espionage","High School"],"year":1202803200000,"rating":[111,244,1255,1790,2033]}
{"isbn":"0689878214","title":"Kill Game","authors":["Francine Pascal"],"summary":"The greatest weapon against a serial killer? A girl with no fear.Gaia Moore isn’t like anyone else in the world. She’s trained in ten different martial arts. She has a sharp mind, and an even sharper tongue. As a teenager she cut class to bust gang members and drug dealers on the streets of New York City. And now Gaia’s been recruited to join the world’s leading crime-fighting organization.At FBI training camp in Quantico, Gaia will become a part of an unparalleled team. She’ll learn the strict codes and procedures of the FBI. She’ll be pushed to her body and mind’s utmost limits.She’ll learn how to hunt serial killers.And she will catch one.","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1348809048i/282202.jpg","genres":["New Adult","Action","Fiction","Romance","Contemporary","Teen","Mystery","Thriller","Young Adult","Espionage"],"year":1117609200000,"rating":[11,33,123,179,181]}
{"isbn":"1250142202","title":"Killing Jesus: A History","authors":["Martin Dugard","Bill O'Reilly"],"summary":"Millions of readers have thrilled to bestselling authors Bill O'Reilly and historian Martin Dugard's Killing Kennedy and Killing Lincoln , page-turning works of nonfiction that have changed the way we read history.The basis for the 2015 television film available on streaming.Now the iconic anchor of The O'Reilly Factor details the events leading up to the murder of the most influential man in Jesus of Nazareth. Nearly two thousand years after this beloved and controversial young revolutionary was brutally killed by Roman soldiers, more than 2.2 billion human beings attempt to follow his teachings and believe he is God. Killing Jesus will take readers inside Jesus's life, recounting the seismic political and historical events that made his death inevitable - and changed the world forever.","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1479249078i/31949128.jpg","genres":["Historical","Christianity","Faith","Biography","Book Club","Nonfiction","History","Religion","Christian","Audiobook"],"year":1489474800000,"rating":[1022,1931,7762,14152,13981]}
{"isbn":null,"title":"Killing Mr. Griffin","authors":["Lois Duncan"],"summary":"Kill their English teacher? Even if Mr. Griffin was the toughest teacher in the school, the one who demanded the most, gave the lowest grades, and refused to turn the classroom into a place where students had 'fun'—there was no reason to kill him. Or was there?Well, Mark suggested, perhaps not kill him—just really frighten him. Kidnap him for a few hours and teach him that students could strike back.No, they never actually intended to kill Mr. Griffin. But sometimes even the best-laid plans go wrong.","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1335826800i/510632.jpg","genres":["School","Mystery Thriller","Horror","Mystery","Banned Books","Suspense","Teen","Thriller","Young Adult","Fiction"],"year":649494000000,"rating":[293,1186,4337,4202,2715]}
{"isbn":"1427274908","title":"Killing Reagan: The Violent Assault That Changed a Presidency","authors":["Martin Dugard","Bill O'Reilly"],"summary":"\n  From the team of Bill O'Reilly and Martin Dugard, bestselling authors of the blockbuster Killing series, now comes Killing Reagan. This page-turning epic account of the career of President Ronald Reagan tells the vivid story of his rise to power -- and the forces of evil that conspired to bring him down.\nJust two months into his presidency, Ronald Reagan lay near death after an assassin's bullet came within inches of his heart. His recovery was nothing short of remarkable -- or so it seemed. But Reagan was grievously injured, forcing him to encounter a challenge that few men ever face. Could he silently overcome his traumatic experience while at the same time carrying out the duties of the most powerful man in the world?Told in the same riveting fashion as Killing Lincoln, Killing Kennedy, Killing Jesus, and Killing Patton, Killing Reagan reaches back to the golden days of Hollywood, where Reagan found both fame and heartbreak, up through the years in California governor's mansion, and finally to the White House, where he presided over boom years and the fall of the Iron Curtain. But it was John Hinckley Jr.'s attack on him that precipitated President Reagan's most heroic actions. In Killing Reagan, O'Reilly and Dugard take readers behind the scenes, creating an unforgettable portrait of a great man operating in violent times.","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1609106578i/56439222.jpg","genres":["Presidents","Historical","American History","Biography","Nonfiction","History","True Crime","Biography Memoir","Politics","Audiobook"],"year":1442905200000,"rating":[242,518,3428,8664,7690]}
{"isbn":"1442440112","title":"Killing Time in Crystal City","authors":["Chris    Lynch"],"summary":"A teen runs away from his broken life and invents a new one in this dazzling adventure from Printz Honor winner and National Book Award finalist Chris Lynch.Crystal City called for him, and Kevin answered. And why wouldn’t he? His relationship with his father is broken—as is his arm. With barely anyone to miss him or care if he’s gone, it seemed like the perfect time for Kevin to run away to his estranged uncle and create an entirely new identity. New name. New attitude. New friends. Maybe even a new girl.From the first moment of adventure, Kevin’s life takes a turn for the exciting. Making friends seems easy with his new persona, especially when a group of homeless beach bums instantly includes him in their crew. But do they like the real Kevin, or the guy he’s pretending to be? And will this new lifestyle help Kevin escape from the misery of his former life—or will it drag him right back into the reasons he left home?","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1421037718i/13260674.jpg","genres":["Realistic Fiction","Contemporary","Friendship","Family","Young Adult","Fiction"],"year":1421136000000,"rating":[11,39,31,10,6]}
{"isbn":"0345486447","title":"Killjoy","authors":["Julie Garwood"],"summary":"When it comes to gripping novels of unrelenting suspense, Julie Garwood is in a class by herself. In the course of her career, she has mastered the art of creating characters who live and breathe in compelling, page-burning stories that never fail to surprise. As her legion of fans can attest, she strikes the perfect balance between excitement and insight, action and heart. Now, in this breathless new novel, Garwood has written her most electrifying thriller to date.KILLJOYAvery Delaney has always tried to put the past far behind her. Abandoned by her rapacious, conniving mother when she was only three days old, Avery was raised by her grandmother and beloved aunt Carolyn. Then, when she was eleven, she witnessed her grandmother’s violent death, before Avery herself was shot and left for dead. Miraculously she survived. The man responsible is serving time in a Florida prison. This traumatic experience propels Avery into a life of law and order.Her razor-sharp mind and ability to gather data and decipher evidence has made Avery an expert crime analyst for the FBI. But soon she will have to use every one of her adroit skills on a case that hits painfully close to home.Avery’s workaholic aunt, Carolyn Salvetti, is certain her (hopefully soon-to-be ex) husband sent her the gold embossed reservation to the posh Utopia Spa in the mountains of Colorado. At first she is resistant, but then figures it will be a welcome respite from the cutthroat advertising business, not to mention a networking extravaganza. Plus she persuades her niece to join her for the two weeks of luxury and decadence.But Carolyn never makes it to Utopia. Under false pretenses, she is taken to an isolated retreat by a handsome stranger with a dazzling smile, suave demeanor, and the darkest of motives. His name is Monk, a hired assassin. Now, with scant clues and fewer resources, Avery must track down and save Carolyn—and outmaneuver a brilliant killer who is part of an elaborate plot of madness and lethal vengeance.From the Hardcover edition.","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1171575622i/107790.jpg","genres":["Romantic Suspense","Contemporary Romance","Romance","Contemporary","Mystery Thriller","Crime","Mystery","Suspense","Thriller","Fiction"],"year":1127804400000,"rating":[159,701,3499,6156,6439]}
{"isbn":"1534300287","title":"Kill or be Killed, Vol. 1","authors":["Elizabeth Breitweiser","Sean Phillips","Ed Brubaker"],"summary":"The bestselling team of Ed Brubaker and Sean Phillips (The Fade Out, Criminal, Fatale) return with Kill or Be Killed, Volume One, the twisted story of a young man forced to kill bad people, and how he struggles to keep his secret from destroying his life. Both a thriller and a deconstruction of vigilantism, Kill or Be Killed is unlike anything Brubaker and Phillips have ever done.Collecting: Kill or Be Killed 1-4","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1476408721i/31247173.jpg","genres":["Comics","Fiction","Crime","Graphic Novels","Horror","Mystery","Comic Book","Fantasy","Thriller","Graphic Novels Comics"],"year":1485244800000,"rating":[50,177,889,2525,2052]}
{"isbn":"153430228X","title":"Kill or be Killed, Vol. 2","authors":["Elizabeth Breitweiser","Sean Phillips","Ed Brubaker"],"summary":"Brubaker and Phillips best-selling series keeps on hitting, as our vigilante hero goes deeper into the darkness, and the NYPD begin to realize there's a masked man killing bad guys all over town. Both a thriller and a deconstruction of vigilantism, KILL OR BE KILLED is unlike anything this award-winning team has done before.Collecting: Kill or Be Killed 5-10","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1489970489i/34504726.jpg","genres":["Comics","Graphic Novels Comics","Crime","Graphic Novels","Horror","Mystery","Comic Book","Fantasy","Thriller","Fiction"],"year":1502780400000,"rating":[28,69,506,1779,1577]}
{"isbn":"141970947X","title":"Kindred: A Graphic Novel Adaptation","authors":["Nnedi Okorafor","Octavia E. Butler","John Jennings","Damian Duffy"],"summary":"I lost an arm on my last trip home. Home is a new house with a loving husband in 1970s California that suddenly transformed in to the frightening world of the antebellum South. Dana, a young black writer, can't explain how she is transported across time and space to a plantation in Maryland. But she does quickly understand why: to deal with the troubles of Rufus, a conflicted white slaveholder--and her progenitor. Her survival, her very existence, depends on it. This searing graphic-novel adaptation of Octavia E. Butler's science fiction classic is a powerfully moving, unflinching look at the violent disturbing effects of slavery on the people it chained together, both black and white--and made kindred in the deepest sense of the word.","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1456379336i/28818221.jpg","genres":["Historical","Graphic Novels Comics","Adult","Graphic Novels","Time Travel","Science Fiction","Fantasy","African American","Historical Fiction","Fiction"],"year":1484035200000,"rating":[57,298,1623,4549,4538]}
{"isbn":"0807083690","title":"Kindred","authors":["Octavia E. Butler"],"summary":"The visionary author’s masterpiece pulls us—along with her Black female hero—through time to face the horrors of slavery and explore the impacts of racism, sexism, and white supremacy then and now.Dana, a modern Black woman, is celebrating her 26th birthday with her new husband when she is snatched abruptly from her home in California and transported to the antebellum South. Rufus, the white son of a plantation owner, is drowning, and Dana has been summoned to save him. Dana is drawn back repeatedly through time to the slave quarters, and each time the stay grows longer, more arduous, and more dangerous until it is uncertain whether or not Dana’s life will end, long before it has a chance to begin.","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1339423248i/60931.jpg","genres":["Historical","Race","Classics","Book Club","Time Travel","Fantasy","Science Fiction","Historical Fiction","Audiobook","Fiction"],"year":1075622400000,"rating":[1422,5296,28770,94082,120293]}
{"isbn":"1338129333","title":"King and the Dragonflies","authors":["Kacen Callender"],"summary":"Twelve-year-old Kingston James is sure his brother Khalid has turned into a dragonfly. When Khalid unexpectedly passed away, he shed what was his first skin for another to live down by the bayou in their small Louisiana town. Khalid still visits in dreams, and King must keep these secrets to himself as he watches grief transform his family.It would be easier if King could talk with his best friend, Sandy Sanders. But just days before he died, Khalid told King to end their friendship, after overhearing a secret about Sandy—that he thinks he might be gay. \"You don't want anyone to think you're gay too, do you?\"But when Sandy goes missing, sparking a town-wide search, and King finds his former best friend hiding in a tent in his backyard, he agrees to help Sandy escape from his abusive father, and the two begin an adventure as they build their own private paradise down by the bayou and among the dragonflies. As King's friendship with Sandy is reignited, he's forced to confront questions about himself and the reality of his brother's death.","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1561211214i/44575111.jpg","genres":["Realistic Fiction","Childrens","Contemporary","Magical Realism","Queer","LGBT","Middle Grade","Audiobook","Young Adult","Fiction"],"year":1580803200000,"rating":[62,145,1084,3899,4649]}
{"isbn":"1149441151","title":"Le morte Darthur: Sir Thomas Malory's book of King Arthur and his noble knights of the Round table","authors":["Thomas Malory"],"summary":"This is a reproduction of a book published before 1923. This book may have occasional imperfections such as missing or blurred pages, poor pictures, errant marks, etc. that were either part of the original artifact, or were introduced by the scanning process. We believe this work is culturally important, and despite the imperfections, have elected to bring it back into print as part of our continuing commitment to the preservation of printed works worldwide. We appreciate your understanding of the imperfections in the preservation process, and hope you enjoy this valuable book.","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1347485149i/9840104.jpg","genres":["Adventure","Historical","Classics","Literature","Arthurian","Mythology","Fantasy","Poetry","Historical Fiction","Fiction"],"year":1273820400000,"rating":[530,2092,9650,14304,12164]}
{"isbn":"0866119825","title":"King Arthur and the Knights of the Round Table","authors":["Joshua E. Hanft","Howard Pyle","Pablo Marcos"],"summary":"The world's best-loved children's stories set in large type for easy reading.-- Over 100 illustrations in each book","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1387663048i/1322450.jpg","genres":["Adventure","Historical","Classics","Childrens","Arthurian","Mythology","Fantasy","Medieval","Historical Fiction","Fiction"],"year":725875200000,"rating":[132,504,2324,3468,3405]}
{"isbn":"1639731067","title":"Kingdom of Ash","authors":["Sarah J. Maas"],"summary":"An alternative cover edition for this ISBN can be found here.Aelin Galathynius has vowed to save her people ― but at a tremendous cost. Locked within an iron coffin by the Queen of the Fae, Aelin must draw upon her fiery will as she endures months of torture. The knowledge that yielding to Maeve will doom those she loves keeps her from breaking, but her resolve is unraveling with each passing day…With Aelin captured, friends and allies are scattered to different fates. Some bonds will grow even deeper, while others will be severed forever. As destinies weave together at last, all must fight if Erilea is to have any hope of salvation.Years in the making, Sarah J. Maas's New York Times bestselling Throne of Glass series draws to an explosive conclusion as Aelin fights to save herself―and the promise of a better world.","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1673567331i/76715522.jpg","genres":["New Adult","Fae","Romance","Romantasy","Fantasy Romance","High Fantasy","Magic","Young Adult Fantasy","Young Adult","Fiction"],"year":1676361600000,"rating":[2911,6903,36568,150003,683917]}
{"isbn":"0008302235","title":"Kingdom of Souls","authors":["Rena Barron"],"summary":"A girl with no gifts must bargain for the power to fight her own mother’s dark schemes—even if the price is her life. Heir to two lines of powerful witchdoctors, Arrah yearns for magic of her own. Yet she fails at bone magic, fails to call upon her ancestors, and fails to live up to her family’s legacy. Under the disapproving eye of her mother, the Kingdom’s most powerful priestess and seer, she fears she may never be good enough.But when the Kingdom’s children begin to disappear, Arrah is desperate enough to turn to a forbidden, dangerous ritual. If she has no magic of her own, she’ll have to buy it—by trading away years of her own life.Arrah’s borrowed power reveals a nightmarish betrayal, and on its heels, a rising tide of darkness that threatens to consume her and all those she loves. She must race to unravel a twisted and deadly scheme… before the fight costs more than she can afford.","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1557497574l/44596261.jpg","genres":["Paranormal","Mythology","High Fantasy","Fantasy","Magic","Young Adult Fantasy","Audiobook","Young Adult","Fiction","Witches"],"year":1568876400000,"rating":[153,455,1594,2175,1381]}
{"isbn":"1952457106","title":"A Kingdom of Flesh and Fire","authors":["Jennifer L. Armentrout"],"summary":"A Betrayal…Everything Poppy has ever believed in is a lie, including the man she was falling in love with. Thrust among those who see her as a symbol of a monstrous kingdom, she barely knows who she is without the veil of the Maiden. But what she does know is that nothing is as dangerous to her as him. The Dark One. The Prince of Atlantia. He wants her to fight him, and that’s one order she’s more than happy to obey. He may have taken her, but he will never have her.A Choice...Casteel Da’Neer is known by many names and many faces. His lies are as seductive as his touch. His truths as sensual as his bite. Poppy knows better than to trust him. He needs her alive, healthy, and whole to achieve his goals. But he’s the only way for her to get what she wants—to find her brother Ian and see for herself if he has become a soulless Ascended. Working with Casteel instead of against him presents its own risks. He still tempts her with every breath, offering up all she’s ever wanted. Casteel has plans for her. Ones that could expose her to unimaginable pleasure and unfathomable pain. Plans that will force her to look beyond everything she thought she knew about herself—about him. Plans that could bind their lives together in unexpected ways that neither kingdom is prepared for. And she’s far too reckless, too hungry, to resist the temptation.A Secret…But unrest has grown in Atlantia as they await the return of their Prince. Whispers of war have become stronger, and Poppy is at the very heart of it all. The King wants to use her to send a message. The Descenters want her dead. The wolven are growing more unpredictable. And as her abilities to feel pain and emotion begin to grow and strengthen, the Atlantians start to fear her. Dark secrets are at play, ones steeped in the blood-drenched sins of two kingdoms that would do anything to keep the truth hidden. But when the earth begins to shake, and the skies start to bleed, it may already be too late.","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1734440592i/54319549.jpg","genres":["Paranormal","New Adult","Fiction","Romantasy","Enemies To Lovers","Fantasy","Fantasy Romance","Magic","Audiobook","Vampires"],"year":1598943600000,"rating":[5635,15758,59621,159465,277999]}
{"isbn":"0316342084","title":"Kingdom of the Feared","authors":["Kerri Maniscalco"],"summary":"Emilia is reeling from the shocking discovery that her twin sister, Vittoria, is alive. But before she faces the demons of her past, Emilia yearns to claim her king, the seductive Prince of Wrath, in the flesh. Emilia doesn’t simply desire his body, she wants his heart and soul—but that’s something the enigmatic demon can’t promise her.When a high-ranking member of House Greed is assassinated, Emilia and Wrath are drawn to the rival demon court. Damning evidence points to Vittoria as the murderer and she’s quickly declared an enemy of the Seven Circles. Despite her betrayal, Emilia will do anything to solve this new mystery and find out who her sister really is.Together Emilia and Wrath play a sin-fueled game of deception as they work to stop the unrest that’s brewing between witches, demons, shape-shifters and the most treacherous foes of all: the Feared.Emilia was warned that when it came to the Wicked nothing was as it seemed. But, have the true villains been much closer all along? When the truth is finally revealed, it just might end up costing Emilia her heart.Two curses.One prophecy.A reckoning all have feared.And a love more powerful than fate. All hail the king and queen of Hell.From the #1 New York Times bestselling author of the Stalking the Jack the Ripper series comes the steamy conclusion to Kingdom of the Wicked trilogy.","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1644386147i/58470171.jpg","genres":["Paranormal","New Adult","Romance","Romantasy","Enemies To Lovers","Fantasy Romance","Magic","Young Adult","Fiction","Witches"],"year":1664262000000,"rating":[2932,10004,32685,50260,42121]}
{"isbn":"0385732910","title":"King Dork","authors":["Frank Portman"],"summary":"In this coming-of-age, rock-and-roll, Da Vinci Code-style tale, high school loser Tom Henderson discovers his deceased father's copy of The Catcher in the Rye and finds himself in the middle of several interlocking conspiracies and at least half a dozen mysteries.","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1386924182i/10570.jpg","genres":["Realistic Fiction","Coming Of Age","Humor","Contemporary","Teen","Mystery","Music","Young Adult","Fiction","High School"],"year":1144738800000,"rating":[352,825,2068,2391,1539]}
{"isbn":"1682630536","title":"King & Kayla and the Case of Found Fred","authors":["Dori Hillestad Butler","Nancy Meyers"],"summary":"King &amp; Kayla are back on the case in this laugh-out-loud mystery from the Theodor Seuss Geisel Honor Award-winning series.When King and Kayla meet Fred, a lost dog, they collect clues to him find his human family. Analytical Kayla notices that Fred knows basic commands but has no collar. This dog isn't a stray.Sensitive King notices that Fred smells like smoke and hamburgers. There's a campground nearby and there were fireworks just a few days ago. Can King and Kayla put the pieces together and find Fred's family?With simple, straightforward language and great verbal and visual humor, the King &amp; Kayla series is perfect for newly independent readers. King and Kayla model excellent problem-solving skills, including working as a team, gathering facts, making lists, and evaluating evidence.","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1541428731i/40585479.jpg","genres":["Chapter Books","Fiction","Humor","Picture Books","Cultural","Dogs","1st Grade","Mystery","Animals","Childrens"],"year":1551772800000,"rating":[0,2,37,85,57]}
{"isbn":"1529350506","title":"Kingdom of the Cursed","authors":["Kerri Maniscalco"],"summary":"After selling her soul to become Queen of the Wicked, Emilia travels to the Seven Circles with the enigmatic Prince of Wrath, where she’s introduced to a seductive world of vice.She vows to do whatever it takes to avenge her beloved sister, Vittoria... even if that means accepting the hand of the Prince of Pride, the king of demons.The first rule in the court of the Wicked? Trust no one. With back-stabbing princes, luxurious palaces, mysterious party invitations, and conflicting clues about who really killed her twin, Emilia finds herself more alone than ever before. Can she even trust Wrath, her one-time ally in the mortal world... or is he keeping dangerous secrets about his true nature? Emilia will be tested in every way as she seeks a series of magical objects that will unlock the clues of her past and the answers she craves...One sister. Two sinful princes.Infinite deception with a side of revenge… Welcome to Hell.From #1 New York Times bestselling author of Stalking Jack the Ripper Kerri Maniscalco comes the sizzling, sweepingly romantic sequel to Kingdom of the Wicked!","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1613554873i/52772417.jpg","genres":["Paranormal","New Adult","Romantasy","Enemies To Lovers","Fantasy Romance","Magic","Audiobook","Young Adult","Fiction","Witches"],"year":1635231600000,"rating":[2328,8620,34418,78518,78058]}
{"isbn":"1782760563","title":"Kingdom Of The Wicked","authors":["Ian Edginton","D'Israeli"],"summary":"A children's author is sucked back into the world of his childhood imagination - only to find it transformed into a landscape of horror! Can he escape this prison of the mind - or end the war that has devastated his imagination?The twenty-first century's greatest living children's author - Christopher Grahame - is drawn back into Castrovalva, the world of his childhood imagination, when the stress of his fame starts to weigh on him. But Castrovalva has gone to hell in his absence - devastated by war, famine and loss. And now Christopher can't wake up. Has he lost his mind... or his innocence?","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1396238351i/21544660.jpg","genres":["Comics","Fiction","Graphic Novels","Horror","Comic Book","Fantasy","Graphic Novels Comics"],"year":1420531200000,"rating":[4,7,56,79,52]}
{"isbn":"1682632075","title":"King & Kayla and the Case of the Gold Ring","authors":["Dori Hillestad Butler","Nancy Meyers"],"summary":"King &amp; Kayla are back on the case in this laugh-out-loud mystery from the Theodor Seuss Geisel Honor Award-winning series.King, Kayla, Mason, and Asia are playing in the snow. Later, Asia discovers her gold ring is missing. What happened to it?Analytical Kayla has a plan. Together the friends retrace their steps and thoroughly search the area. Sensitive King remembers the crow he saw outside. Crows like shiny things. Can King and Kayla put the pieces together and find the lost ring?With simple, straightforward language and great verbal and visual humor, the King &amp; Kayla series is perfect for newly independent readers. King and Kayla model excellent problem-solving skills, including working as a team, gathering facts, making lists, and evaluating evidence.","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1599572199i/54793419.jpg","genres":["Chapter Books","Humor","Fiction","Friendship","Dogs","Animal Fiction","Mystery","Animals","Childrens"],"year":1612252800000,"rating":[0,3,29,53,24]}
{"isbn":"1561458791","title":"King & Kayla and the Case of the Mysterious Mouse","authors":["Dori Hillestad Butler","Nancy Meyers"],"summary":"A lovable dog helps his human girl solve a mystery. King and Kayla are playing fetch with their friends, Jillian and Thor. Jillian throws Kings favorite ball too hard, and now its gone missing! King and Kayla must put together the clues to figure out where it wentand who has it.","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1495554420i/34437039.jpg","genres":["Chapter Books","Adventure","Humor","Fiction","Picture Books","Dogs","Mystery","Animals","African American","Childrens"],"year":1504594800000,"rating":[0,1,41,103,64]}
{"isbn":null,"title":"King & Kayla and the Case of the Lost Library Book: King & Kayla, Book 8","authors":["Dori Hillestad Butler"],"summary":"Kayla needs to return her library books, but she can’t find one of them. Can King and Jillian help solve the crime? From the Geisel Honor-winning early reader series.Kayla needs to return her library books so she can check out new ones. But she can’t find one of them. Where could it be? Can King and Kayla’s friend Jillian help?Great for introducing mysteries and the important concepts of fact gathering, list making, clues, and analytical thinking. Also ideal for diverse book collections.","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1742365103i/229565899.jpg","genres":["Chapter Books","Realistic Fiction","Humor","Childrens","Picture Books","Dogs","Mystery","Fantasy","Animals","Fiction"],"year":1643702400000,"rating":[0,10,97,144,79]}
{"isbn":"1561458775","title":"King & Kayla and the Case of the Missing Dog Treats","authors":["Dori Hillestad Butler","Nancy Meyers"],"summary":"Kayla made peanut butter treats for Jillian's new puppy, Thor. But now the treats are missing.  What does Kayla know? There are three treats missing. King was in the kitchen. King's breath doesn't smell like peanut butter.  What does King know? There's an intruder in the house.  How will they solve the mystery?","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1480688688i/31620949.jpg","genres":["Chapter Books","Realistic Fiction","Fiction","Humor","Picture Books","Dogs","Mystery","Animals","African American","Childrens"],"year":1488873600000,"rating":[6,10,136,306,215]}
{"isbn":"0913940690","title":"King Kong","authors":["Ian Thorne"],"summary":"Presents synopses of several films whose plots revolve around the escapades of a giant ape named King Kong.","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1320800624i/2155851.jpg","genres":["Horror","Film","Fantasy","Childrens"],"year":220953600000,"rating":[0,1,8,12,29]}
{"isbn":"1682630552","title":"King & Kayla and the Case of the Unhappy Neighbor","authors":["Dori Hillestad Butler","Nancy Meyers"],"summary":"King &amp; Kayla are back on the case in this laugh-out-loud mystery from the Theodor Seuss Geisel Honor Award-winning series.Thor is in big trouble. Mr. Gary says he knocked over his trash cans, dug up his garden, and ate some of his vegetables. King and Kayla have to clear Thor's name and find the actual culprit.Analytical Kayla demonstrates that Thor isn't big enough to knock over heavy trash cans and he doesn't like vegetables. Sensitive King discovers evidence that someone else has been in Mr. Gary's yard—and it's not a dog. Who made Mr. Gary unhappy?With simple, straightforward language and great verbal and visual humor, the King &amp; Kayla series is perfect for newly independent readers. King and Kayla model excellent problem-solving skills, including working as a team, gathering facts, making lists, and evaluating evidence.","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1566292362i/45069942.jpg","genres":["Chapter Books","Humor","Childrens","Picture Books","Dogs","Mystery","Animals","Fiction"],"year":1583222400000,"rating":[1,2,29,61,33]}
{"isbn":"1561458783","title":"King & Kayla and the Case of the Secret Code","authors":["Dori Hillestad Butler","Nancy Meyers"],"summary":"Kayla and Mason both got mysterious letters, written in code.  What does Kayla know? The same person left both letters. It's someone she and Mason both know. The two letters are the same, except for the second word.  What does King know? Jillian left the letters. What do the letters say?","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1480688742i/31620950.jpg","genres":["Chapter Books","Humor","Childrens","Picture Books","Cultural","Dogs","Mystery","Animals","African American","Fiction"],"year":1488873600000,"rating":[1,5,52,144,87]}
{"isbn":null,"title":"King of Battle and Blood","authors":["Scarlett St.  Clair"],"summary":"Their Union Is His Revenge.Isolde de Lara considers her wedding day her death day. To end a years-long war, she is to marry vampire king, Adrian Aleksandr Vasiliev, and kill him. But her assassination attempt is thwarted and Adrian threatens that if Isolde tries to kill him again, he will raise her as the undead. Faced with the possibility of becoming the thing she hates most, Isolde seeks other ways to defy him and survive the brutal vampire court. Except it isn’t the court she fears most — it’s Adrian. Despite their undeniable chemistry, she wonders why the king — fierce, savage, merciless — chose her as consort. The answer will shatter her world.","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1617457059i/56651967.jpg","genres":["Paranormal","Fiction","Adult","Romantasy","Enemies To Lovers","Fantasy","Fantasy Romance","Audiobook","Vampires","Paranormal Romance"],"year":1638259200000,"rating":[4798,12421,36351,48710,35483]}
{"isbn":"0152062580","title":"King of the Screwups","authors":["K.L. Going"],"summary":"Liam Geller is Mr. Popularity. Everybody loves him. He excels at sports; he knows exactly what clothes to wear; he always ends up with the most beautiful girls in school. But he's got an uncanny ability to screw up in the very ways that tick off his father the most.When Liam finally kicked out of the house, his father's brother takes him in. What could a teenage chick magnet possibly have in common with his gay, glam rocker, DJ uncle who lives in a trailer in upstate New York? A lot more than you'd think. And when Liam attempts to make himself over as a nerd in a desperate attempt to impress his father, it's his \"aunt\" Pete and the guys in his band who convince Liam there's much more to him than his father will ever see.","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1347752672i/5867731.jpg","genres":["Realistic Fiction","Coming Of Age","Humor","Contemporary","Queer","Teen","LGBT","Young Adult","Fiction","High School"],"year":1239001200000,"rating":[50,193,658,943,701]}
{"isbn":"1770463593","title":"King of King Court","authors":["Travis Dandro"],"summary":"A dynamic and devastating memoir about the cycle of trauma caused by addiction within one familyFrom a child’s-eye view, Travis Dandro recounts growing up with a drug-addicted birth father, alcoholic step-dad, and overwhelmed mother. As a kid, Dandro would temper the everyday tension with flights of fancy, finding refuge in toys and animals and insects rather than in the unpredictable adults around him. He perceptively details the effects of poverty and addiction on a family while maintaining a child’s innocence for as long as he can.King of King Court spans from Travis’s early childhood through his teen years, focusing not only on the obviously abusive actions but also on the daily slights and snubs that further strain relations between him and his parents. Alongside his birth father committing crimes and shooting up, King of King Court lingers on scenes of him criticizing Travis and his siblings. Dandro gives equal heft to these anecdotes, emphasizing how damaging even relatively slight traumas can be to a child’s worldview.As Travis matures into young adulthood and begins to understand the forces shaping his father’s toxic behaviors, the story becomes even more nuanced. Travis is empathetic to his father’s own tragic history but unable to escape the cycle of misconduct and reprisals. King of King Court is a revelatory autobiography that examines trauma, addiction, and familial relations in a unique and sensitive way.","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1537987376i/41940317.jpg","genres":["Comics","Graphic Novels Comics","Adult","Biography","Family","Graphic Novels","Nonfiction","Biography Memoir","Autobiography","Memoir"],"year":1565074800000,"rating":[2,26,146,239,128]}
{"isbn":"125014227X","title":"King of Scars","authors":["Leigh Bardugo"],"summary":"Face your demons... or feed them.The dashing young king, Nikolai Lantsov, has always had a gift for the impossible. No one knows what he endured in his country's bloody civil war--and he intends to keep it that way. Now, as enemies gather at his weakened borders, Nikolai must find a way to refill Ravka's coffers, forge new alliances, and stop a rising threat to the once-great Grisha Army.Yet with every day a dark magic within him grows stronger, threatening to destroy all he has built. With the help of a young monk and a legendary Grisha general, Nikolai will journey to the places in Ravka where the deepest magic survives to vanquish the terrible legacy inside him. He will risk everything to save his country and himself. But some secrets aren't meant to stay buried--and some wounds aren't meant to heal.","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1525110825i/36307634.jpg","genres":["Adventure","Romance","High Fantasy","Fantasy","LGBT","Magic","Young Adult Fantasy","Audiobook","Young Adult","Fiction"],"year":1548748800000,"rating":[1116,5372,35372,96152,83670]}
{"isbn":"1492656666","title":"Kingsbane","authors":["Claire Legrand"],"summary":"In this sequel to the instant New York Times bestseller Furyborn, two queens, separated by a thousand years, connected by secrets and lies, must continue their fight amid deadly plots and unthinkable betrayals that will test their strength—and their hearts.Rielle Dardenne has been anointed Sun Queen, but her trials are far from over. The Gate keeping the angels at bay is falling. To repair it, Rielle must collect the seven hidden castings of the saints. Meanwhile, to help her prince and love Audric protect Celdaria, Rielle must spy on the angel Corien—but his promises of freedom and power may prove too tempting to resist.Centuries later, Eliana Ferracora grapples with her new reality: She is the Sun Queen, humanity's long-awaited savior. But fear of corruption—fear of becoming another Rielle—keeps Eliana's power dangerous and unpredictable. Hunted by all, racing against time to save her dying friend Navi, Eliana must decide how to wear a crown she never wanted—by embracing her mother's power, or rejecting it forever.","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1549198915i/40523458.jpg","genres":["New Adult","Romance","High Fantasy","Fantasy","LGBT","Magic","Young Adult Fantasy","Audiobook","Young Adult","Fiction"],"year":1558422000000,"rating":[337,1273,5158,8815,6323]}
{"isbn":"0943706904","title":"King Solomon & the Queen of Sheba","authors":["Avi Katz","Linda Tarry","Blu Greenberg"],"summary":"The story of KING SOLOMON AND THE QUEEN OF SHEBA tells how Queen Makeda set out to learn whether King Solomon truly possessed the wisdom of the ages. She devises a series of clever riddles that will putsolomon to the test. But as the king answers her riddles, Makeda realizes that she has discovered more than wisdom; she has found a whole new way of looking at the world...and at God.","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1348603178i/1003445.jpg","genres":null,"year":875689200000,"rating":[1,3,2,10,8]}
{"isbn":"0593326180","title":"Kings of B'more","authors":["R. Eric Thomas"],"summary":"\n  Two Black, queer best friends face their last day together with an epic journey through Baltimore in this magnetic YA debut by celebrated cultural critic and bestselling Here For It author R. Eric Thomas.\nWith junior year starting in the fall, Harrison feels like he's on the precipice of, well, everything. Standardized testing, college, and the terrifying unknowns and looming pressures of adulthood after that--it's like the future wants to eat him alive. Which is why Harrison is grateful that he and his best friend Linus will face these things together. But at the end of a shift at their summer job, Linus invites Harrison to their special spot overlooking the city to deliver devastating news: he's moving out of state at the end of the week. To keep from completely losing it--and partially inspired by a cheesy movie-night pick by his Dad--Harrison plans a send-off à la Ferris Bueller's Day Off that's worthy of his favorite person. If they won't be having all the life-expanding experiences they thought they would, Harrison will squeeze them all into their last day. They end up on a mini road trip, their first Pride, and a rooftop dance party, all while keeping their respective parents, who track them on a family location app, off their trail. Harrison and Linus make a pact to do all the things--big and small--they've been too scared to do. But nothing feels scarier than saying goodbye to someone you love.","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1634833438i/58936406.jpg","genres":["Realistic Fiction","Romance","Contemporary","Book Club","Queer","Young Adult Contemporary","LGBT","Audiobook","Young Adult","Fiction"],"year":1653980400000,"rating":[8,44,196,323,227]}
{"isbn":"1534430652","title":"Kings, Queens, and In-Betweens","authors":["Tanya Boteju"],"summary":"Perpetually awkward Nima Kumara-Clark is bored with her insular community of Bridgeton, in love with her straight girlfriend, and trying to move past her mother’s unexpected departure. After a bewildering encounter at a local festival, Nima finds herself suddenly immersed in the drag scene on the other side of town.Macho drag kings, magical queens, new love interests, and surprising allies propel Nima both painfully and hilariously closer to a self she never knew she could be—one that can confidently express and accept love. But she’ll have to learn to accept lost love to get there.","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1555269913i/42202063.jpg","genres":["Romance","Contemporary","Queer","Young Adult Contemporary","LGBT","Gay","Lesbian","Audiobook","Young Adult","Fiction"],"year":1557212400000,"rating":[55,200,943,1363,757]}
{"isbn":"0312355092","title":"Kiss & Blog","authors":["Alyson Noel"],"summary":"What's the best revenge when your best friend ditches you for the popular crowd? Alyson Noël reveals all in her hot new young adult novel, Kiss &amp; Blog. As freshmen at Ocean High last year, Winter and her best friend Sloane thought they could ditch their nerdy past, launching from invisible to cool. But after another miserable year of standing on the sidelines they make a pact to do whatever it takes not to go unnoticed in their sophomore year, promising each other that whoever makes it into the cool group first will bring the other along.One Sloane gets a taste of life on the A-list, she slams that door in Winter's face. Suddenly cast out of her former best friend's life, Winter takes revenge the modern way: by announcing all of Sloane's dirty little secrets on an anonymous blog. Then the blog becomes more popular than she ever dreamed and Winter must decide if her retaliation is really worth the consequences—and if the price for popularity is one she's willing to pay. Once again, Alyson Noël navigates the tricky waters of the high school social scene with the heart and humor her readers have come to love.","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1441412602i/928420.jpg","genres":["Realistic Fiction","Contemporary Romance","Romance","Contemporary","Chick Lit","Teen","Young Adult Contemporary","Young Adult","Fiction","High School"],"year":1179212400000,"rating":[69,223,619,617,535]}
{"isbn":"0593325265","title":"Kiss & Tell","authors":["Adib Khorram"],"summary":"Kiss &amp; Tell is a total rush! Perfectly sweet and swoon worthy. I loved every page! - Julie Murphy, New York Times bestselling author of Dumplin'A smart, sexy YA novel about a boy band star, his first breakup, his first rebound, and what it means to be queer in the public eye, from award-winning author Adib KhorramHunter never expected to be a boy band star, but, well, here he is. He and his band Kiss &amp; Tell are on their first major tour of North America, playing arenas all over the United States and Canada (and getting covered by the gossipy press all over North America as well). Hunter is the only gay member of the band, and he just had a very painful breakup with his first boyfriend--leaked sexts, public heartbreak, and all--and now everyone expects him to play the perfect queer role model for teens.But Hunter isn't really sure what being the perfect queer kid even means. Does it mean dressing up in whatever The Label tells him to wear for photo shoots and pretending never to have sex? (Unfortunately, yes.) Does it mean finding community among the queer kids at the meet-and-greets after K&amp;T's shows? (Fortunately, yes.) Does it include a new relationship with Kaivan, the drummer for the band opening for K&amp;T on tour? (He hopes so.) But when The Label finds out about Hunter and Kaivan, it spells trouble--for their relationship, for the perfect gay boy Hunter plays for the cameras, and, most importantly, for Hunter himself.","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1625597777i/58502672.jpg","genres":["Romance","Contemporary","Queer","LGBT","Music","M M Romance","Gay","Audiobook","Young Adult","Fiction"],"year":1647932400000,"rating":[111,447,1712,2127,962]}
{"isbn":"174348495X","title":"Kings Rising","authors":["C.S. Pacat"],"summary":"\n  Damianos of Akielos has returned.\n His identity now revealed, Damen must face his master Prince Laurent as Damianos of Akielos, the man Laurent has sworn to kill. On the brink of a momentous battle, the future of both their countries hangs in the balance. In the south, Kastor's forces are massing. In the north, the Regent's armies are mobilising for war. Damen's only hope of reclaiming his throne is to fight together with Laurent against their usurpers.Forced into an uneasy alliance the two princes journey deep into Akielos, where they face their most dangerous opposition yet. But even if the fragile trust they have built survives the revelation of Damen's identity – can it stand against the Regents final, deadly play for the throne?","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1454160767i/17158532.jpg","genres":["Historical","Adult","Queer","Enemies To Lovers","LGBT","Fantasy","M M Romance","Gay","Historical Fiction","Fiction"],"year":1454400000000,"rating":[681,1570,6805,20698,43671]}
{"isbn":"1250196930","title":"Kiss Number 8","authors":["Ellen T. Crenshaw","Colleen A.F. Venable"],"summary":"Mads is pretty happy with her life. She goes to church with her family, and minor league baseball games with her dad. She goofs off with her best friend Cat, and has thus far managed to avoid getting kissed by Adam, the boy next door. It's everything she hoped high school would be… until all of a sudden, it's not.Her dad is hiding something big—so big it could tear her family apart. And that’s just the beginning of her problems: Mads is starting to figure out that she doesn't want to kiss Adam… because the only person she wants to kiss is Cat.Kiss Number 8, a graphic novel from writer Colleen AF Venable and illustrator Ellen T. Crenshaw, is a layered, funny, sharp-edged story of teen sexuality and family secrets.","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1527077022i/39073370.jpg","genres":["Comics","Realistic Fiction","Romance","Contemporary","Queer","Graphic Novels","Teen","LGBT","Young Adult","Fiction"],"year":1552374000000,"rating":[131,362,1331,2408,2160]}
{"isbn":"0061956961","title":"Kisses from Hell","authors":["Francesca Lia Block","Kristin Cast","Alyson Noel","Richelle Mead","Kelley Armstrong"],"summary":"Truly, Madly, UndeadlyThis irresistible collection features stories of love amid vampires by five of today's hottest authors—Kristin Cast (Tempted), Richelle Mead (Vampire Academy), Alyson Noël (Evermore), Kelley Armstrong (The Summoning), and Francesca Lia Block (Pretty Dead).From a fugitive vampire forced to trust a boy who might work for the group bent on destroying her to the legendary romance of two immortals whose love compels them to risk everything, this heart-pounding collection brings new meaning to the words \"love you forever.\" Whether you're into romances that are dark and moody or light and fun, these stories will quench that insatiable thirst for enchanting tales of the beautiful undead.Part of the Kisses from Hell Anthology","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1266813433i/7343947.jpg","genres":["Paranormal","Supernatural","Romance","Urban Fantasy","Short Stories","Fantasy","Anthologies","Paranormal Romance","Young Adult","Vampires"],"year":1282633200000,"rating":[306,993,2621,2009,2284]}
{"isbn":"0142408697","title":"Kissing Kate","authors":["Lauren Myracle"],"summary":"Kate was Lissa's best friend. They've shared everything for four years. Then one night at a drunken party, Kate leaned in to kiss Lissa, and Lissa kissed her back. And now Kate is pretending Lissa doesn't exist. Confused and alone, Lissa's left questioning everything she thought she knew about herself, and about life. But with the help of a free-spirit new friend, Lissa's beginning to find the strength to realize that sometimes falling in love with the wrong person is the only way to find your footing.","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1386923658i/270367.jpg","genres":["Realistic Fiction","Romance","Contemporary","Queer","Teen","LGBT","Gay","Lesbian","Young Adult","Fiction"],"year":1176966000000,"rating":[424,1098,2903,2611,3147]}
{"isbn":"1637994702","title":"The Definitely Dominguita Series. 4 Books Collection Set. Knight of the Cape, Captain Dom's Treasur, All for One, Sherlock Dom by Terry Catasus Jennings","authors":["Terry Catasús Jennings"],"summary":"The Definitely Dominguita Series Knight of the Cape, 9781534465022 Captain Dom's Treasur, 9781534465053 All for One, 9781534465114 Sherlock Dom, 9781534465084 Terry Catasus Jennings","cover":null,"genres":null,"year":1637049600000,"rating":[0,0,0,0,0]}
{"isbn":"6023852866","title":"King's Cage","authors":["Victoria Aveyard","Reni Indardini"],"summary":"“Jadilah saksi atas tawanan ini, atas pertanda kemenangan ini!Ini dia Mare Barrow, pemimpin Barisan Merah. Seorang Pembunuh, teroris, musuh besar kerajaan kita. Dan, sekarang, dia berlutut di hadapan kita.Darahnya yang mengucur menjadi bukti akan identitasnya.”Gadis berkekuatan petir dari Kaum Merah—Mare Barrow—tertangkap saat memberontak dan ditahan dalam sangkar cantik Kerajaan Norta. Maven, sang Raja Kaum Perak, terobsesi membalas dendam kepadanya. Dia menjadikan Mare boneka yang tak berdaya menolak perintahnya.Namun, pemberontakan belum selesai. Percobaan pembunuhan terhadap sang Raja terjadi dan perang pun berkobar. Mare diselamatkan. Kini dia harus berlatih keras untuk menyempurnakan kekuatannya demi pertarungan puncak nanti. Di tengah situasi yang semakin panas, hubungan Mare dengan Cal—Pangeran Perak yang terbuang—pun semakin dalam.Perang menjanjikan dimulainya Era Baru. Namun, benarkah semua perbedaan bisa bersatu dan perdamaian bisa tercipta? Bagaimana jika untuk mencapai itu semua, Mare harus melepaskan hal terpenting dalam hidupnya?","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1494038980i/35072205.jpg","genres":["Dystopia","Romance","High Fantasy","Fantasy","Science Fiction","Magic","Young Adult Fantasy","Audiobook","Young Adult","Fiction"],"year":1493622000000,"rating":[5093,16989,67337,106465,85029]}
{"isbn":"1335402519","title":"Kneel","authors":["Candace Buford"],"summary":"The system is rigged.For guys like Russell Boudreaux, football is the only way out of their small town. As the team’s varsity tight end, Rus has a singular goal: to get a scholarship and play on the national stage. But when his best friend is unfairly arrested and kicked off the team, Rus faces an impossible choice: speak up or live in fear.“Please rise for the national anthem.”Desperate for change, Rus kneels during the national anthem. In one instant, he falls from local stardom and becomes a target for hatred. But he’s not alone. With the help of his best friend and an unlikely ally, Rus will fight for his dreams, and for justice.","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1613645545i/55743833.jpg","genres":["Realistic Fiction","Contemporary","Friendship","Sports","Teen","Young Adult Contemporary","Social Justice","Audiobook","Young Adult","Fiction"],"year":1631602800000,"rating":[8,13,103,322,248]}
{"isbn":"0066236568","title":"Knocked Out by My Nunga-Nungas: Further, Further Confessions of Georgia Nicolson","authors":["Louise Rennison"],"summary":"As I was going out of my bedroom door I remembered my nungas. Perhaps I should take some precautions to keep them under strict control. Maybe bits of Sellotape on the ends of them to keep them from doing anything alarming? I'd like to trust them, but they are very unreliable. The irrepressible heroine of the Michael L. Printz Honor Book Angus, Thongs and Full-Frontal Snogging is back, and funnier than ever! Georgia has finally landed Robbie the Sex God, but he's never around, and Georgia's ex, Dave the Laugh, is starting to look quite dreamy. Strangely, so does just about every other guy Georgia meets, even the new French teacher. In this third installment of Georgia's hilarious confessions, Georgia's \"red bottomosity\" is out of control! Whatever will happen next?","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1388284730i/112633.jpg","genres":["Romance","Humor","Contemporary","Childrens","Chick Lit","Teen","Comedy","British Literature","Young Adult","Fiction"],"year":1021359600000,"rating":[448,1555,7397,10142,10714]}
{"isbn":"0316209171","title":"Knock Knock: My Dad's Dream for Me","authors":["Daniel Beaty","Bryan Collier"],"summary":"Every morning, I play a game with my father.He goes knock knock on my door and I pretend to be asleep till he gets right next to the bed.And my papa, he tells me, \"I love you.\"But what happens when, one day, that \"knock knock\" doesn't come? This powerful and inspiring book shows the love that an absent parent can leave behind, and the strength that children find in themselves as they grow up and follow their dreams.","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1369817794i/17269361.jpg","genres":["Realistic Fiction","Love","Fiction","Picture Books","Cultural","Juvenile","Poetry","African American","Family","Childrens"],"year":1387267200000,"rating":[11,38,194,569,1192]}
{"isbn":"0805054790","title":"Knots on a Counting Rope","authors":["John Archambault","Bill Martin Jr.","Ted Rand"],"summary":"In Knots on a Counting Rope , Bill Martin, Jr. and John Archambault tell a poignant story about a boy’s emerging confidence in facing his blindness in this beautiful children’s picture book illustrated by Ted Rand.By the warmth of a campfire beneath a starry night sky, a Navajo youth named Boy-Strength-of-Blue-Horses listens to the tale of his birth from his grandfather. Although blind, the boy learns that he has the strength to cope with his condition and meet any challenge that comes his way.“The powerful, spare, poetic text is done full justice by Rand’s fine full-color illustrations…The love, hope, and courage expressed are universal.”― Booklist (starred review)","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1412111530i/241585.jpg","genres":["Realistic Fiction","Fiction","Picture Books","Cultural","Disability","Native American","Indigenous","Historical Fiction","Family","Childrens"],"year":874306800000,"rating":[43,72,251,399,543]}
{"isbn":"0684848287","title":"Kaffir Boy: An Autobiography","authors":["Mark Mathabane"],"summary":"The classic story of life in Apartheid South Africa.Mark Mathabane was weaned on devastating poverty and schooled in the cruel streets of South Africa's most desperate ghetto, where bloody gang wars and midnight police raids were his rites of passage. Like every other child born in the hopelessness of apartheid, he learned to measure his life in days, not years. Yet Mark Mathabane, armed only with the courage of his family and a hard-won education, raised himself up from the squalor and humiliation to win a scholarship to an American university.This extraordinary memoir of life under apartheid is a triumph of the human spirit over hatred and unspeakable degradation. For Mark Mathabane did what no physically and psychologically battered \"Kaffir\" from the rat-infested alleys of Alexandra was supposed to do -- he escaped to tell about it.","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1442887234i/126151.jpg","genres":["Africa","Race","School","Biography","Nonfiction","South Africa","History","Biography Memoir","Autobiography","Memoir"],"year":907743600000,"rating":[252,524,2546,5736,7246]}
{"isbn":"0735223718","title":"Know My Name","authors":["Chanel Miller"],"summary":"She was known to the world as Emily Doe when she stunned millions with a letter. Brock Turner had been sentenced to just six months in county jail after he was found sexually assaulting her on Stanford’s campus. Her victim impact statement was posted on BuzzFeed, where it instantly went viral–viewed by eleven million people within four days, it was translated globally and read on the floor of Congress; it inspired changes in California law and the recall of the judge in the case. Thousands wrote to say that she had given them the courage to share their own experiences of assault for the first time.Now she reclaims her identity to tell her story of trauma, transcendence, and the power of words. It was the perfect case, in many ways–there were eyewitnesses, Turner ran away, physical evidence was immediately secured. But her struggles with isolation and shame during the aftermath and the trial reveal the oppression victims face in even the best-case scenarios. Her story illuminates a culture biased to protect perpetrators, indicts a criminal justice system designed to fail the most vulnerable, and, ultimately, shines with the courage required to move through suffering and live a full and beautiful life.Know My Name will forever transform the way we think about sexual assault, challenging our beliefs about what is acceptable and speaking truth to the tumultuous reality of healing. It also introduces readers to an extraordinary writer, one whose words have already changed our world. Entwining pain, resilience, and humor, this memoir will stand as a modern classic.","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1567612158l/50196744.jpg","genres":["Feminism","Autobiography","Adult","Biography","Book Club","Nonfiction","True Crime","Biography Memoir","Audiobook","Memoir"],"year":1569308400000,"rating":[618,1907,10447,42921,179138]}
{"isbn":"0805093079","title":"Killing Lincoln: The Shocking Assassination that Changed America Forever","authors":["Martin Dugard","Bill O'Reilly"],"summary":"Killing Lincoln( The Shocking Assassination That Changed America Forever) &lt;&gt; Compact Disc &lt;&gt; BillO'Reilly &lt;&gt; MacMillanAudio","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1317793681i/10587120.jpg","genres":["Presidents","Historical","American History","Biography","Book Club","Nonfiction","History","Civil War","Politics","Audiobook"],"year":1317106800000,"rating":[3947,4154,17000,39267,42671]}
{"isbn":"0439855624","title":"Kin","authors":["Holly Black","Ted Naifeh"],"summary":"Rue Silver's mother has disappeared . . . and her father has been arrested, suspected of killing her. But it's not as straightforward as that. Because Rue is a faerie, like her mother was. And her father didn't kill her mother -- instead, he broke a promise to Rue's faerie king grandfather, which caused Rue's mother to be flung back to the faerie world. Now Rue must go to save her -- and must also defeat a dark faerie that threatens our very mortal world.","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1389168106i/2929794.jpg","genres":["Paranormal","Comics","Fae","Fiction","Graphic Novels","Teen","Fantasy","Fairies","Young Adult","Urban Fantasy"],"year":1222844400000,"rating":[132,512,1806,1643,1035]}
{"isbn":"1631496700","title":"Kim Jiyoung, Born 1982","authors":["Jamie Chang","Cho Nam-Joo"],"summary":"A fierce international bestseller that launched Korea’s new feminist movement, Kim Jiyoung, Born 1982 follows one woman’s psychic deterioration in the face of rigid misogyny.Truly, flawlessly, completely, she became that person.In a small, tidy apartment on the outskirts of the frenzied metropolis of Seoul lives Kim Jiyoung. A thirtysomething-year-old “millennial everywoman,” she has recently left her white-collar desk job—in order to care for her newborn daughter full-time—as so many Korean women are expected to do. But she quickly begins to exhibit strange symptoms that alarm her husband, parents, and in-laws: Jiyoung impersonates the voices of other women—alive and even dead, both known and unknown to her. As she plunges deeper into this psychosis, her discomfited husband sends her to a male psychiatrist.In a chilling, eerily truncated third-person voice, Jiyoung’s entire life is recounted to the psychiatrist—a narrative infused with disparate elements of frustration, perseverance, and submission. Born in 1982 and given the most common name for Korean baby girls, Jiyoung quickly becomes the unfavored sister to her princeling little brother. Always, her behavior is policed by the male figures around her—from the elementary school teachers who enforce strict uniforms for girls, to the coworkers who install a hidden camera in the women’s restroom and post their photos online. In her father’s eyes, it is Jiyoung’s fault that men harass her late at night; in her husband’s eyes, it is Jiyoung’s duty to forsake her career to take care of him and their child—to put them first.Jiyoung’s painfully common life is juxtaposed against a backdrop of an advancing Korea, as it abandons “family planning” birth control policies and passes new legislation against gender discrimination. But can her doctor flawlessly, completely cure her, or even discover what truly ails her?Rendered in minimalist yet lacerating prose, Kim Jiyoung, Born 1982 sits at the center of our global #MeToo movement and announces the arrival of writer of international significance","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1587128688i/46041199.jpg","genres":["Feminism","Literary Fiction","Asia","Contemporary","Womens","Adult","Book Club","Asian Literature","Audiobook","Fiction"],"year":1586847600000,"rating":[660,3869,26770,76680,65687]}
{"isbn":"1421531321","title":"Karakuridôji Ultimo, #1","authors":["Hiroyuki Takei","Stan Lee"],"summary":"Reads R to L (Japanese Style). Pure Vice vs. Pure Virtue. Can one win without corrupting the other? Kurenai Doji: With girl and money troubles, life is hard enough for hgh school student Yamato, but then he stumbles upon Ultimo, a peculiar-looking puppet. Things only get stranger when Ultimo awakens and his archenemy Vice shows up. Will this be the battle that finally decides good versus evil, or is this just the beginning of a fantastic adventure?","cover":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1347516949i/7519647.jpg","genres":["Comics Manga","Comics","Action","Graphic Novels","Fantasy","Shonen","Science Fiction","Manga"],"year":1265097600000,"rating":[14,30,134,89,136]}
